lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/boards.txt
generic_nrf54l15_module_36pin.menu.clean_ble.on=Enabled (Default)
generic_nrf54l15_module_36pin.menu.clean_ble.on.build.ble_flags=-DNRF54L15_CLEAN_BLE_ENABLED=1

generic_nrf54l15_module_36pin.menu.clean_ble.off=Disabled
generic_nrf54l15_module_36pin.menu.clean_ble.off.build.ble_flags=-DNRF54L15_CLEAN_BLE_ENABLED=0 -DNRF54L15_CLEAN_BLE_DISABLED

generic_nrf54l15_module_36pin.menu.clean_ble_trace.off=Disabled (Default)
generic_nrf54l15_module_36pin.menu.clean_ble_trace.off.build.ble_trace_flags=

generic_nrf54l15_module_36pin.menu.clean_ble_trace.on=Enabled
generic_nrf54l15_module_36pin.menu.clean_ble_trace.on.build.ble_trace_flags=-DNRF54L15_CLEAN_BLE_TRACE=1

generic_nrf54l15_module_36pin.menu.clean_vpr.on=Enabled (Default)
generic_nrf54l15_module_36pin.menu.clean_vpr.on.build.ldscript=nrf54l15_linker_script.ld
generic_nrf54l15_module_36pin.menu.clean_vpr.on.build.vpr_flags=-DNRF54L15_CLEAN_VPR_ENABLED=1
generic_nrf54l15_module_36pin.menu.clean_vpr.on.upload.maximum_data_size=155648

generic_nrf54l15_module_36pin.menu.clean_vpr.off=Disabled (Reclaim RAM for Non-VPR Sketches)
generic_nrf54l15_module_36pin.menu.clean_vpr.off.build.ldscript=nrf54l15_linker_script_no_vpr.ld
generic_nrf54l15_module_36pin.menu.clean_vpr.off.build.vpr_flags=-DNRF54L15_CLEAN_VPR_ENABLED=0 -DNRF54L15_CLEAN_VPR_DISABLED
generic_nrf54l15_module_36pin.menu.clean_vpr.off.upload.maximum_data_size=261632

generic_nrf54l15_module_36pin.menu.clean_zigbee.on=Enabled (Default)
generic_nrf54l15_module_36pin.menu.clean_zigbee.on.build.zigbee_flags=-DNRF54L15_CLEAN_ZIGBEE_ENABLED=1

generic_nrf54l15_module_36pin.menu.clean_zigbee.off=Disabled
generic_nrf54l15_module_36pin.menu.clean_zigbee.off.build.zigbee_flags=-DNRF54L15_CLEAN_ZIGBEE_ENABLED=0 -DNRF54L15_CLEAN_ZIGBEE_DISABLED








generic_nrf54l15_module_36pin.menu.clean_thread.off=Disabled (Default)
generic_nrf54l15_module_36pin.menu.clean_thread.off.build.thread_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_ENABLE=0 -DOPENTHREAD_FTD=1 -DOPENTHREAD_MTD=0 -DOPENTHREAD_RADIO=0
generic_nrf54l15_module_36pin.menu.clean_thread.off.build.thread_seam_flags=
generic_nrf54l15_module_36pin.menu.clean_thread.off.build.thread_crypto_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_CRYPTO_FALLBACK_ENABLE=0

generic_nrf54l15_module_36pin.menu.clean_thread.stage=Experimental Stage Core (Leader/Child/Router + UDP)
generic_nrf54l15_module_36pin.menu.clean_thread.stage.build.thread_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_ENABLE=1 -DOPENTHREAD_FTD=1 -DOPENTHREAD_MTD=0 -DOPENTHREAD_RADIO=0
generic_nrf54l15_module_36pin.menu.clean_thread.stage.build.thread_seam_flags=-DOPENTHREAD_CONFIG_CORE_USER_CONFIG_HEADER_ENABLE=1 -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/src/core -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/include -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/src/include
generic_nrf54l15_module_36pin.menu.clean_thread.stage.build.thread_crypto_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_CRYPTO_FALLBACK_ENABLE=0

generic_nrf54l15_module_36pin.menu.clean_matter.off=Disabled (Default)
generic_nrf54l15_module_36pin.menu.clean_matter.off.build.matter_flags=-DNRF54L15_CLEAN_MATTER_CORE_ENABLE=0 -DNRF54L15_CLEAN_MATTER_TRANSPORT_THREAD=1 -DNRF54L15_CLEAN_MATTER_RENDEZVOUS_ON_NETWORK_ONLY=1 -DNRF54L15_CLEAN_MATTER_BLE_RENDEZVOUS=0 -DNRF54L15_CLEAN_MATTER_FIRST_DEVICE_ONOFF_LIGHT=1
generic_nrf54l15_module_36pin.menu.clean_matter.off.build.matter_seam_flags=

generic_nrf54l15_module_36pin.menu.clean_matter.stage=Experimental Compile Target (On-Network On/Off Light)
generic_nrf54l15_module_36pin.menu.clean_matter.stage.build.matter_flags=-DNRF54L15_CLEAN_MATTER_CORE_ENABLE=1 -DNRF54L15_CLEAN_MATTER_TRANSPORT_THREAD=1 -DNRF54L15_CLEAN_MATTER_RENDEZVOUS_ON_NETWORK_ONLY=1 -DNRF54L15_CLEAN_MATTER_BLE_RENDEZVOUS=0 -DNRF54L15_CLEAN_MATTER_FIRST_DEVICE_ONOFF_LIGHT=1
generic_nrf54l15_module_36pin.menu.clean_matter.stage.build.matter_seam_flags=-DNRF54L15_CLEAN_MATTER_HEADER_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_SUPPORT_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_CORE_ERROR_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_CORE_KEY_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_TIME_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_HEX_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_THREAD_DATASET_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_DATA_MODEL_SEED_AVAILABLE=1 -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/src/matter_core_stage -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src

generic_nrf54l15_module_36pin.menu.clean_upload.pyocd=pyOCD (CMSIS-DAP, Default)
generic_nrf54l15_module_36pin.menu.clean_upload.pyocd.upload.tool=nrf54upload
generic_nrf54l15_module_36pin.menu.clean_upload.pyocd.upload.tool.serial=nrf54upload
generic_nrf54l15_module_36pin.menu.clean_upload.pyocd.upload.runner=pyocd
generic_nrf54l15_module_36pin.menu.clean_upload.pyocd.upload.use_1200bps_touch=false

generic_nrf54l15_module_36pin.menu.clean_upload.pyocd_vm=pyOCD VM Safe (No Reset / VirtualBox)
generic_nrf54l15_module_36pin.menu.clean_upload.pyocd_vm.upload.tool=nrf54upload
generic_nrf54l15_module_36pin.menu.clean_upload.pyocd_vm.upload.tool.serial=nrf54upload
generic_nrf54l15_module_36pin.menu.clean_upload.pyocd_vm.upload.runner=pyocd
generic_nrf54l15_module_36pin.menu.clean_upload.pyocd_vm.upload.use_1200bps_touch=false
generic_nrf54l15_module_36pin.menu.clean_upload.pyocd_vm.upload.pyocd_safe=true

generic_nrf54l15_module_36pin.menu.clean_upload.openocd_legacy=OpenOCD Direct (Experimental)
generic_nrf54l15_module_36pin.menu.clean_upload.openocd_legacy.upload.tool=nrf54openocd
generic_nrf54l15_module_36pin.menu.clean_upload.openocd_legacy.upload.tool.serial=nrf54openocd
generic_nrf54l15_module_36pin.menu.clean_upload.openocd_legacy.upload.runner=openocd
generic_nrf54l15_module_36pin.menu.clean_upload.openocd_legacy.upload.use_1200bps_touch=false

generic_nrf54l15_module_36pin.menu.clean_upload.uf2=UF2 Bootloader (Manual only, Optional)
generic_nrf54l15_module_36pin.menu.clean_upload.uf2.upload.tool=nrf54upload
generic_nrf54l15_module_36pin.menu.clean_upload.uf2.upload.tool.serial=nrf54upload
generic_nrf54l15_module_36pin.menu.clean_upload.uf2.upload.protocol=uf2
generic_nrf54l15_module_36pin.menu.clean_upload.uf2.upload.runner=uf2
generic_nrf54l15_module_36pin.menu.clean_upload.uf2.upload.use_1200bps_touch=false
generic_nrf54l15_module_36pin.menu.clean_upload.uf2.upload.wait_for_upload_port=false

nrf54l15dk_pca10156.name=Nordic PCA10156 nRF54L15 DK

nrf54l15dk_pca10156.upload.tool=nrf54upload
nrf54l15dk_pca10156.upload.tool.serial=nrf54upload
nrf54l15dk_pca10156.upload.protocol=cmsis-dap
nrf54l15dk_pca10156.upload.maximum_size=1556480
nrf54l15dk_pca10156.upload.maximum_data_size=155648
nrf54l15dk_pca10156.upload.wait_for_upload_port=false
nrf54l15dk_pca10156.upload.use_1200bps_touch=false
nrf54l15dk_pca10156.upload.disable_flushing=true
nrf54l15dk_pca10156.upload.runner=pyocd
nrf54l15dk_pca10156.upload.target=nrf54l
nrf54l15dk_pca10156.upload.uid=
nrf54l15dk_pca10156.upload.openocd_script={runtime.platform.path}/tools/openocd/nrf54l15.cfg
nrf54l15dk_pca10156.upload.openocd_speed=4000
nrf54l15dk_pca10156.upload.openocd_bin={runtime.tools.openocd-0.11.0-arduino2.path}/bin/openocd

