lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/boards.txt
nrf54l15dk_pca10156.serial.disableDTR=false
nrf54l15dk_pca10156.serial.disableRTS=false

nrf54l15dk_pca10156.build.mcu=cortex-m33
nrf54l15dk_pca10156.build.f_cpu=64000000L
nrf54l15dk_pca10156.build.board=NRF54L15DK_PCA10156
nrf54l15dk_pca10156.build.core=nrf54l15
nrf54l15dk_pca10156.build.variant=nrf54l15dk_pca10156
nrf54l15dk_pca10156.build.ldscript=nrf54l15_linker_script.ld
nrf54l15dk_pca10156.build.uf2_family=0xADA54B15
nrf54l15dk_pca10156.build.uf2_base_address=0x00000000
nrf54l15dk_pca10156.build.cpu_flags=-DARDUINO_NRF54_CPU_64M
nrf54l15dk_pca10156.build.power_flags=-DNRF54L15_CLEAN_POWER_LOW
nrf54l15dk_pca10156.build.boot_flags=
nrf54l15dk_pca10156.build.auto_gate_flags=
nrf54l15dk_pca10156.build.security_flags=
nrf54l15dk_pca10156.build.ble_flags=-DNRF54L15_CLEAN_BLE_ENABLED=1
nrf54l15dk_pca10156.build.ble_tx_flags=
nrf54l15dk_pca10156.build.ble_timing_flags=
nrf54l15dk_pca10156.build.ble_trace_flags=
nrf54l15dk_pca10156.build.vpr_flags=-DNRF54L15_CLEAN_VPR_ENABLED=1
nrf54l15dk_pca10156.build.zigbee_flags=-DNRF54L15_CLEAN_ZIGBEE_ENABLED=1
nrf54l15dk_pca10156.build.zigbee_channel_flags=
nrf54l15dk_pca10156.build.zigbee_pan_flags=
nrf54l15dk_pca10156.build.antenna_flags=
nrf54l15dk_pca10156.build.serial_flags=-DNRF54L15_CLEAN_SERIAL_ROUTE_HEADER -DNRF54L15_CLEAN_SERIAL_ROUTE_HEADER_SWAP_INSTANCES
nrf54l15dk_pca10156.build.extra_flags=-DARDUINO_NRF54L15 -DNRF54L15_XXAA {build.cpu_flags} {build.power_flags} {build.boot_flags} {build.auto_gate_flags} {build.security_flags} {build.ble_flags} {build.ble_tx_flags} {build.ble_timing_flags} {build.ble_trace_flags} {build.vpr_flags} {build.zigbee_flags} {build.zigbee_channel_flags} {build.zigbee_pan_flags} {build.thread_flags} {build.thread_seam_flags} {build.thread_crypto_flags} {build.matter_flags} {build.matter_seam_flags} {build.antenna_flags} {build.serial_flags}

nrf54l15dk_pca10156.menu.clean_ble.on=Enabled (Default)
nrf54l15dk_pca10156.menu.clean_ble.on.build.ble_flags=-DNRF54L15_CLEAN_BLE_ENABLED=1

nrf54l15dk_pca10156.menu.clean_ble.off=Disabled
nrf54l15dk_pca10156.menu.clean_ble.off.build.ble_flags=-DNRF54L15_CLEAN_BLE_ENABLED=0 -DNRF54L15_CLEAN_BLE_DISABLED

nrf54l15dk_pca10156.menu.clean_ble_trace.off=Disabled (Default)
nrf54l15dk_pca10156.menu.clean_ble_trace.off.build.ble_trace_flags=

nrf54l15dk_pca10156.menu.clean_ble_trace.on=Enabled
nrf54l15dk_pca10156.menu.clean_ble_trace.on.build.ble_trace_flags=-DNRF54L15_CLEAN_BLE_TRACE=1

nrf54l15dk_pca10156.menu.clean_vpr.on=Enabled (Default)
nrf54l15dk_pca10156.menu.clean_vpr.on.build.ldscript=nrf54l15_linker_script.ld
nrf54l15dk_pca10156.menu.clean_vpr.on.build.vpr_flags=-DNRF54L15_CLEAN_VPR_ENABLED=1
nrf54l15dk_pca10156.menu.clean_vpr.on.upload.maximum_data_size=155648

nrf54l15dk_pca10156.menu.clean_vpr.off=Disabled (Reclaim RAM for Non-VPR Sketches)
nrf54l15dk_pca10156.menu.clean_vpr.off.build.ldscript=nrf54l15_linker_script_no_vpr.ld
nrf54l15dk_pca10156.menu.clean_vpr.off.build.vpr_flags=-DNRF54L15_CLEAN_VPR_ENABLED=0 -DNRF54L15_CLEAN_VPR_DISABLED
nrf54l15dk_pca10156.menu.clean_vpr.off.upload.maximum_data_size=261632

nrf54l15dk_pca10156.menu.clean_zigbee.on=Enabled (Default)
nrf54l15dk_pca10156.menu.clean_zigbee.on.build.zigbee_flags=-DNRF54L15_CLEAN_ZIGBEE_ENABLED=1

nrf54l15dk_pca10156.menu.clean_zigbee.off=Disabled
nrf54l15dk_pca10156.menu.clean_zigbee.off.build.zigbee_flags=-DNRF54L15_CLEAN_ZIGBEE_ENABLED=0 -DNRF54L15_CLEAN_ZIGBEE_DISABLED








nrf54l15dk_pca10156.menu.clean_thread.off=Disabled (Default)
nrf54l15dk_pca10156.menu.clean_thread.off.build.thread_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_ENABLE=0 -DOPENTHREAD_FTD=1 -DOPENTHREAD_MTD=0 -DOPENTHREAD_RADIO=0
nrf54l15dk_pca10156.menu.clean_thread.off.build.thread_seam_flags=
nrf54l15dk_pca10156.menu.clean_thread.off.build.thread_crypto_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_CRYPTO_FALLBACK_ENABLE=0

nrf54l15dk_pca10156.menu.clean_thread.stage=Experimental Stage Core (Leader/Child/Router + UDP)
nrf54l15dk_pca10156.menu.clean_thread.stage.build.thread_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_ENABLE=1 -DOPENTHREAD_FTD=1 -DOPENTHREAD_MTD=0 -DOPENTHREAD_RADIO=0
nrf54l15dk_pca10156.menu.clean_thread.stage.build.thread_seam_flags=-DOPENTHREAD_CONFIG_CORE_USER_CONFIG_HEADER_ENABLE=1 -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/src/core -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/include -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/src/include
nrf54l15dk_pca10156.menu.clean_thread.stage.build.thread_crypto_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_CRYPTO_FALLBACK_ENABLE=0

nrf54l15dk_pca10156.menu.clean_matter.off=Disabled (Default)
nrf54l15dk_pca10156.menu.clean_matter.off.build.matter_flags=-DNRF54L15_CLEAN_MATTER_CORE_ENABLE=0 -DNRF54L15_CLEAN_MATTER_TRANSPORT_THREAD=1 -DNRF54L15_CLEAN_MATTER_RENDEZVOUS_ON_NETWORK_ONLY=1 -DNRF54L15_CLEAN_MATTER_BLE_RENDEZVOUS=0 -DNRF54L15_CLEAN_MATTER_FIRST_DEVICE_ONOFF_LIGHT=1
nrf54l15dk_pca10156.menu.clean_matter.off.build.matter_seam_flags=

nrf54l15dk_pca10156.menu.clean_matter.stage=Experimental Compile Target (On-Network On/Off Light)
nrf54l15dk_pca10156.menu.clean_matter.stage.build.matter_flags=-DNRF54L15_CLEAN_MATTER_CORE_ENABLE=1 -DNRF54L15_CLEAN_MATTER_TRANSPORT_THREAD=1 -DNRF54L15_CLEAN_MATTER_RENDEZVOUS_ON_NETWORK_ONLY=1 -DNRF54L15_CLEAN_MATTER_BLE_RENDEZVOUS=0 -DNRF54L15_CLEAN_MATTER_FIRST_DEVICE_ONOFF_LIGHT=1
nrf54l15dk_pca10156.menu.clean_matter.stage.build.matter_seam_flags=-DNRF54L15_CLEAN_MATTER_HEADER_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_SUPPORT_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_CORE_ERROR_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_CORE_KEY_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_TIME_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_HEX_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_THREAD_DATASET_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_DATA_MODEL_SEED_AVAILABLE=1 -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/src/matter_core_stage -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src

nrf54l15dk_pca10156.menu.clean_serial.header=VCOM1 on P1.04/P1.05 (Default)
nrf54l15dk_pca10156.menu.clean_serial.header.build.serial_flags=-DNRF54L15_CLEAN_SERIAL_ROUTE_HEADER -DNRF54L15_CLEAN_SERIAL_ROUTE_HEADER_SWAP_INSTANCES

nrf54l15dk_pca10156.menu.clean_serial.altuart=Alternate UART on P0.00/P0.01
nrf54l15dk_pca10156.menu.clean_serial.altuart.build.serial_flags=

nrf54l15dk_pca10156.menu.clean_serial.disabled=GPIO on UART pads (Serial disabled)
nrf54l15dk_pca10156.menu.clean_serial.disabled.build.serial_flags=-DNRF54L15_CLEAN_SERIAL_DISABLED

nrf54l15dk_pca10156.menu.clean_upload.pyocd=pyOCD (CMSIS-DAP, Default)
nrf54l15dk_pca10156.menu.clean_upload.pyocd.upload.tool=nrf54upload
nrf54l15dk_pca10156.menu.clean_upload.pyocd.upload.tool.serial=nrf54upload
nrf54l15dk_pca10156.menu.clean_upload.pyocd.upload.runner=pyocd
nrf54l15dk_pca10156.menu.clean_upload.pyocd.upload.use_1200bps_touch=false

nrf54l15dk_pca10156.menu.clean_upload.pyocd_vm=pyOCD VM Safe (No Reset / VirtualBox)
nrf54l15dk_pca10156.menu.clean_upload.pyocd_vm.upload.tool=nrf54upload
nrf54l15dk_pca10156.menu.clean_upload.pyocd_vm.upload.tool.serial=nrf54upload
nrf54l15dk_pca10156.menu.clean_upload.pyocd_vm.upload.runner=pyocd
nrf54l15dk_pca10156.menu.clean_upload.pyocd_vm.upload.use_1200bps_touch=false
nrf54l15dk_pca10156.menu.clean_upload.pyocd_vm.upload.pyocd_safe=true

nrf54l15dk_pca10156.menu.clean_upload.openocd_legacy=OpenOCD Direct (Experimental)
nrf54l15dk_pca10156.menu.clean_upload.openocd_legacy.upload.tool=nrf54openocd
nrf54l15dk_pca10156.menu.clean_upload.openocd_legacy.upload.tool.serial=nrf54openocd
nrf54l15dk_pca10156.menu.clean_upload.openocd_legacy.upload.runner=openocd
nrf54l15dk_pca10156.menu.clean_upload.openocd_legacy.upload.use_1200bps_touch=false

nrf54l15dk_pca10156.menu.clean_upload.uf2=UF2 Bootloader (Manual only, Optional)
nrf54l15dk_pca10156.menu.clean_upload.uf2.upload.tool=nrf54upload
nrf54l15dk_pca10156.menu.clean_upload.uf2.upload.tool.serial=nrf54upload
nrf54l15dk_pca10156.menu.clean_upload.uf2.upload.protocol=uf2
nrf54l15dk_pca10156.menu.clean_upload.uf2.upload.runner=uf2
nrf54l15dk_pca10156.menu.clean_upload.uf2.upload.use_1200bps_touch=false
nrf54l15dk_pca10156.menu.clean_upload.uf2.upload.wait_for_upload_port=false
